{"id":"hh1L68RTi1FCHNfXGHkc7A","text_snippet":{"content":"That darn Smokehouse burger is awesome. 5 stars. \n\nThe smoked corn was a little Meh... it was oily like not butter oily... not a huge fan of the texture either. I like corn crunchy and it was not. \n\nService was great. \n\nI did see an unmentionable bug running around near the back entrance towards the chicken rotisserie thing, but bugs have to eat too right? (still 5 stars lol)"},"stars":5,"business_id":"rZbHg4ACfN3iShdsT47WKQ","business_city":"Phoenix","business_full_address":"8501 N 27th Ave\nPhoenix, AZ 85051","business_categories":"American (New); Barbeque; Restaurants","business_name":"Bobby Q","served_dishes":["smoked corn","not butter oily","corn crunchy","chicken rotisserie"],"_id":"hh1L68RTi1FCHNfXGHkc7A","score":0.20000000298023224} 
{"id":"jP-z3uJAqR7J6XEcDq8cMA","text_snippet":{"content":"ok....first let me say that I grew up in PHX. And we used to go for special occasions to \"Bobby MaGees\" which is where BobbyQ's is now located (says something about the quality of my restaurant experiences as a young fella)...And as cheesy as Bobby McGaees was...i kind of miss the pirate serving me my dinner (and the salad bar in the bathtub).\n\nBut i do like what they have done to the place. Cool interior. Casual but with a nice upscale feel. The patio seemed really nice (didn't sit out here).\n\nWe tried a variety of things. A burger, a pulled pork sandwich, brisket, baby backs etc...\n\nI think the standout were the ribs. VERY good...very tender (but not overcooked), good sauce.  I enjoyed every one.Everything else was just ok. Like on par with Chili's (which isn't saying much). \n\nThe sides were pretty tasty. Corn (roasted and then taken off the cob for you) , mashed potatoes, cornbread...all pretty good. \n\nDinner for 4 (2 kids, no booze)...50$.\n\nBut a 5 star place? Maybe in the context of other restaurants in the Dunlap and I-17 areas (next to crazy Mitch's Furniture barn.) But not in the broader context of PHX.\n\nI would definitely go back for ribs...but not a place that will go into the normal rotation.\n\nSide note: Hilarious crowd on a Saturday night. Lots of \"west side\" clubbers...or maybe too old to be clubbers but want to go clubbing (there is a lounge attached)."},"stars":3,"business_id":"rZbHg4ACfN3iShdsT47WKQ","business_city":"Phoenix","business_full_address":"8501 N 27th Ave\nPhoenix, AZ 85051","business_categories":"American (New); Barbeque; Restaurants","business_name":"Bobby Q","served_dishes":["burger","pulled pork sandwich","ribs","good sauce","mashed potatoes","cornbread","booze","ribs"],"_id":"jP-z3uJAqR7J6XEcDq8cMA","score":0.20000000298023224} 
{"id":"8vjB_5z6F0xnkiWNy_PiRw","text_snippet":{"content":"Until Bobby Q's entered my life i wasnt a fan of BBQ anything! made me kinda sad to see so many people enjoying some messy ribs but anyways I i digress...This place has changed my life for the better!. Their St. Louis ribs are fall off the bone AMAZING! and their Mac n Cheese is a must have! I have to admit this place has made me a bit of a ribs snob, if something doesnt come close to Bobby Q's i automatically right that place off.\n\nA short review but you get the gist of it..."},"stars":5,"business_id":"rZbHg4ACfN3iShdsT47WKQ","business_city":"Phoenix","business_full_address":"8501 N 27th Ave\nPhoenix, AZ 85051","business_categories":"American (New); Barbeque; Restaurants","business_name":"Bobby Q","served_dishes":["messy ribs","ribs snob"],"_id":"8vjB_5z6F0xnkiWNy_PiRw","score":0.30000001192092896} 
{"id":"A0-FUf6-Q-NI8iWxF857lQ","text_snippet":{"content":"The BEST of the BEST!\n\nI agree with Daren C.  Killer Burgers, Steaks, Prime Rib and of course ribs.\n\nFood melts in your mouth.  Make this your next restaurant stop.  You will not be disappointed."},"stars":5,"business_id":"rZbHg4ACfN3iShdsT47WKQ","business_city":"Phoenix","business_full_address":"8501 N 27th Ave\nPhoenix, AZ 85051","business_categories":"American (New); Barbeque; Restaurants","business_name":"Bobby Q","served_dishes":[],"_id":"A0-FUf6-Q-NI8iWxF857lQ","score":0.699999988079071} 
{"id":"ca_6nisikghrwKd9w0OAqg","text_snippet":{"content":"I have never had BBQ in the South, Texas, or anywhere outside of California (except Bobby Q), but of all the places I've tried, Bobby Q is my current favorite BBQ place EVER!  I found this place on Yelp and came here while on a trip to Arizona.  The place was pretty crowded but we only  waited about 15-20 minutes.  We ordered babyback ribs, St. Louis ribs, corn, and mac&cheese.  They also give you DELICIOUS AMAZING CORNBREAD!\n\nEverything was excellent.  The St. Louis ribs were the best ribs I have ever had.  They were extremely tender and had a nice flavorful bark on the  outside with dark grill marks.  Their BBQ sauce was equally awesome and the kind I like -- a bit more on the sweeter side, less on the vinegary side.  The babyback ribs were also tasty, but not as flavorful (and less meat of course) than the St. Louis ones.  The sides were good but more forgettable due to the sheer perfection of their ribs.\n\nI don't know if I will ever be in Phoenix again, but this place is a must-return if I ever am.  Oh and at the end of the meal, they gave us complimentary, piping hot FRESH cinnamon donuts!  That double-won me over.  I want Bobby Q right now."},"stars":5,"business_id":"rZbHg4ACfN3iShdsT47WKQ","business_city":"Phoenix","business_full_address":"8501 N 27th Ave\nPhoenix, AZ 85051","business_categories":"American (New); Barbeque; Restaurants","business_name":"Bobby Q","served_dishes":["babyback ribs","flavorful bark","dark grill","BBQ sauce","babyback ribs","their ribs","cinnamon donuts"],"_id":"ca_6nisikghrwKd9w0OAqg","score":0.6000000238418579} 
{"id":"h2c-jLW9cLVIiiubGqTaog","text_snippet":{"content":"On one of my many visits to see mi amore, he took me to this fantastic little pizza joint. The aesthetics of the place were overwhelmingly perfect. I believe the maximum seating capacity of the dining area is 45, yes folks, 45. So the 2 1/2 hour wait was expected, and very VERY worth it. The pizzas are baked to order in a classic brick house oven. The toppings arent what youd find in your local Pizza Hut, either. You can choose from fresh slices of mozzarella, slices of perfectly seasoned italian sausage, pepperoni slices, salami slices, arugula, fresh basil leaves, tomatoes, etc. Basically what Im getting at, is this is beyond words delicious, classic LEGIT Italian pizza. Around the dining area, you will see freshly baked loaves of focaccia bread, that is later served to you with extra virgin olive oil for dipping once you are seated. The smell in that place is heavenly.....incredibly reminiscent of my grandmothers kitchen!!\n\nPS GET THERE EARLY!!"},"stars":5,"business_id":"VVeogjZya58oiTxK7qUjAQ","business_city":"Phoenix","business_full_address":"623 E Adams St\nPhoenix, AZ 85004","business_categories":"Pizza; Restaurants","business_name":"Pizzeria Bianco","served_dishes":["fantastic little","pizzas","toppings","fresh slices","fresh basil leaves","delicious,","LEGIT Italian pizza","freshly baked loaves","focaccia bread","extra virgin olive oil"],"_id":"h2c-jLW9cLVIiiubGqTaog","score":0.5} 
{"id":"DtgJ5aFeUSk7bNGY408WPA","text_snippet":{"content":"Great Pizza! Great food! Great service! Still, this place isn't perfect....\n\nBE PREPARED TO WAIT! Alright, most people seem to know this going in (we did too). However, when you arrive at 7:00pm, and they say you won't be seated until 11:30pm, that doesn't mean you can put your name in and show up at 11...which we almost found out the hard way: **At 10:00pm they will do one last head count. If you're not in the vicinity, soooorrrrry!** Luckily we were calling in every hour for updates (which they recommend, btw). At 9:40pm we called and got the news that we better be there for the last head count (information we probably could have used earlier), and had to hurry on back from our meanderings downtown. At 10:00pm we were deemed worthy to stay on the list and wait another 45 minutes or so.\n\nService: the hostess knows she holds all the cards--sort of like the lady at the cash register for the Soup Nazi. However, a smile was all it took to get one back from her for me. Still, I can see how others might misconstrue her attitude as something less than cordial. Our server was great though! Very helpful and fun. He was as excited to serve us as we were to eat there. Good stuff!\n\nThe pizza is indeed great! But after waiting 4 hours, I was expecting the heavens to part and birds to sing and the ground to shake. Nope. Just made-from-scratch, meticulously-thought-out, high-quality pizza. A light and airy, smoky crust, a decent sauce and fresh mozzarella formed the basis of the Sonny Boy and Wise Guy pizzas that we tried. The quality and tastiness of the toppings were also apparent. We were impressed. This was absolutely great pizza--one of the best we've ever had. ...I just don't know if I'll hurry back to Pizzeria Bianco to wait that long again."},"stars":4,"business_id":"VVeogjZya58oiTxK7qUjAQ","business_city":"Phoenix","business_full_address":"623 E Adams St\nPhoenix, AZ 85004","business_categories":"Pizza; Restaurants","business_name":"Pizzeria Bianco","served_dishes":["pizza","decent sauce","fresh mozzarella","toppings","pizza"],"_id":"DtgJ5aFeUSk7bNGY408WPA","score":0.10000000149011612} 
{"id":"Gp8BXuzWMIDZK9fsYo9PtQ","text_snippet":{"content":"It was 3:45pm and I'm about to jump on a bus to the light rail.  We have no reservations for Pizzeria Bianco, but a couple of friends just got in line and were waiting to get some wine.  Useless fact: they're 26th in line.  So in theory, at 5:00 we're in the first seating.  And so it happens, the publicly-underwritten public transit arrives (my one-way trip cost $1.25, my gf's unvalidated parking fee was $12) and two Hop Knots later, we're sitting down and waiting.  \n\nTypical order, one of everything, two Biancoverdes.  At this point being almost review #200, the details are irrelevant.  The crust is great, the cheese is great, the Sonny Boy is uber-salty and delicious, fruity olive oil, holy shit these roasted peppers, etc.  Why is that person staring at me through the window?\n\nSo I guess the point is, if you make it your only point to go to Bianco, it's hard to be disappointed."},"stars":5,"business_id":"VVeogjZya58oiTxK7qUjAQ","business_city":"Phoenix","business_full_address":"623 E Adams St\nPhoenix, AZ 85004","business_categories":"Pizza; Restaurants","business_name":"Pizzeria Bianco","served_dishes":["cheese","uber-salty and delicious","fruity olive oil","holy shit","roasted peppers"],"_id":"Gp8BXuzWMIDZK9fsYo9PtQ","score":-0.30000001192092896} 
{"id":"1AqE_z07w-kufK2wYA245w","text_snippet":{"content":"Sorry, I really just don't get it. I didn't hate it and I'm not hating on it now, but I don't see what all the fuss is about.\n\n* Pizzas slapped together resulting in uneven, soggy crusts. Our party ordered 5 of the 6 available.\n\n* Psychological warfare of having to wait forever for just a few tables maintains an air of pompous superiority that tricks the famished patrons into reporting the pizza is a lot better than it really is. Waiter actually boasted about the 3 to 4 hour Saturday night wait, which we got around by having reservations!\n\n* Bottles of iced tea and other drinks bought in bulk rather than any alternative that would make more sense.\n\nGood? Not bad... Best in the Phoenix Valley? HIGHLY debatable, but personally I really can't say that I think so... Best is the USA? Impossible, there's just no way.\n\nLGO is better. Cibo is better. Spinato's is better.\n\nMost hyped? Most definitely."},"stars":3,"business_id":"VVeogjZya58oiTxK7qUjAQ","business_city":"Phoenix","business_full_address":"623 E Adams St\nPhoenix, AZ 85004","business_categories":"Pizza; Restaurants","business_name":"Pizzeria Bianco","served_dishes":["uneven,","soggy crusts","pizza","iced tea"],"_id":"1AqE_z07w-kufK2wYA245w","score":-0.20000000298023224} 
{"id":"YvQe-wF-QA7Db9jyOrHuKg","text_snippet":{"content":"Over Hyped ??... Yeah a little but its definitely worth checking out !\nThe pizzas are freshly baked and very minimalistic but extremely tasty ! I particularly loved the ROSA -  Red Onion, Rosemary, Pistachios sprinkled with just the right amount of Parmigiano Reggiano on a thin crisp crust ! \n\nThe classy brick wall and the gorgeous brick oven give a rustic feel to the décor and you feel transported to another time."},"stars":4,"business_id":"VVeogjZya58oiTxK7qUjAQ","business_city":"Phoenix","business_full_address":"623 E Adams St\nPhoenix, AZ 85004","business_categories":"Pizza; Restaurants","business_name":"Pizzeria Bianco","served_dishes":["pizzas","freshly baked","thin crisp crust","classy brick wall"],"_id":"YvQe-wF-QA7Db9jyOrHuKg","score":0.6000000238418579} 
{"id":"GiGm00UCTSDwA0c7RhRDFQ","text_snippet":{"content":"I love the ambiance at Joe's Farm Grill.  It's great to grab your food and sit outside at one of the many picnic tables.  Stopping there with the dogs after an afternoon at Cosmo Dog Park is a must!  There is something for everyone on the menu, from gourmet burgers (all I have to say is fontina! Yum!) to pizza, to ribs.\n\nIt's also a great place to take out-of-state guests who just blew into town from one of those cold climates.  They are usually psyched to be sitting outside enjoying a meal during the winter without having a propane heater involved.  \n\nMake sure you go for a walk on the grounds too.  It's very relaxing and a great way to work off a few calories!"},"stars":4,"business_id":"QnAzW6KMSciUcuJ20oI3Bw","business_city":"Gilbert","business_full_address":"3000 E Ray Rd\nBldg 1\nGilbert, AZ 85296","business_categories":"American (Traditional); Restaurants","business_name":"Joe's Farm Grill","served_dishes":["gourmet burgers","fontina","pizza","ribs"],"_id":"GiGm00UCTSDwA0c7RhRDFQ","score":0.699999988079071} 
{"id":"21Nfgtnns8gZuzNfg7c_QQ","text_snippet":{"content":"Great place for lunch, transport yourself back in time to this quaint farm grill which offers high quality food, fresh ingredients, killer burgers and an atmosphere that is one of a kind.  Good place for breakfast as well.  Family owned restaurant goodness.  Only drawback is the line, however good things come to those who wait."},"stars":4,"business_id":"QnAzW6KMSciUcuJ20oI3Bw","business_city":"Gilbert","business_full_address":"3000 E Ray Rd\nBldg 1\nGilbert, AZ 85296","business_categories":"American (Traditional); Restaurants","business_name":"Joe's Farm Grill","served_dishes":["quaint farm","fresh ingredients","killer burgers","Family owned"],"_id":"21Nfgtnns8gZuzNfg7c_QQ","score":0.800000011920929} 
{"id":"RbAdrppz5Q_zwLsd9FYYaw","text_snippet":{"content":"We are lucky enough to live basically right accross the street.  \n\nThe food is great. Love the thin crust pizzas and the sweet potato fries. They grow a lot of their own veggies. They seasonally sell dates at the farmstand that are GREAT. \n\nYou get your food free on your birthday.\n\nGets very crowded on the weekends!\n\nthe dessert is just OK, but the shakes are great!"},"stars":4,"business_id":"QnAzW6KMSciUcuJ20oI3Bw","business_city":"Gilbert","business_full_address":"3000 E Ray Rd\nBldg 1\nGilbert, AZ 85296","business_categories":"American (Traditional); Restaurants","business_name":"Joe's Farm Grill","served_dishes":["thin crust pizzas","sweet potato fries"],"_id":"RbAdrppz5Q_zwLsd9FYYaw","score":0.6000000238418579} 
{"id":"GFEr11tEyu07dlXlfUbfAA","text_snippet":{"content":"Loved the burgers and the onion rings were fabulous!  This place is a must visi if you are in the Phoenix area anytime soon!"},"stars":5,"business_id":"QnAzW6KMSciUcuJ20oI3Bw","business_city":"Gilbert","business_full_address":"3000 E Ray Rd\nBldg 1\nGilbert, AZ 85296","business_categories":"American (Traditional); Restaurants","business_name":"Joe's Farm Grill","served_dishes":["burgers","onion rings"],"_id":"GFEr11tEyu07dlXlfUbfAA","score":0.8999999761581421} 
{"id":"TEjpikAl-hfs5LHjapam1g","text_snippet":{"content":"INCREDIBLE food, relaxed/great atmosphere, perfect to bring kids/family...the cheeseburger, shredded bbq pork sandwich, sweet potatoes- too die for! Must try! Worth the drive!"},"stars":5,"business_id":"QnAzW6KMSciUcuJ20oI3Bw","business_city":"Gilbert","business_full_address":"3000 E Ray Rd\nBldg 1\nGilbert, AZ 85296","business_categories":"American (Traditional); Restaurants","business_name":"Joe's Farm Grill","served_dishes":["cheeseburger","shredded bbq pork sandwich","sweet potatoes"],"_id":"TEjpikAl-hfs5LHjapam1g","score":0.6000000238418579} 
{"id":"QqUj8brMiWkMicmlWtpPrw","text_snippet":{"content":"Went back to AB a few weekends ago, again for brunch, with a large group.  I was surprised to see that, although they advertise themselves as being a brunch place on the weekends, they have pared their menu down to basically 4 items.  The people that I invited that had never been to AB before were expecting more of a variety in brunch items since I'd told them that they had great brunch, but their concerns were quelled with a few bloody Marys and some good (if not diverse) food.  I had the egg sandwich sans bacon again (excellent again) and Sweet Pea and I split the french toast as well.  We'd only had a small sample of the french toast at the opening, so we didn't realize that it comes with this whole jar of cream and berries, in addition to the syrup.  If you come here for brunch and like french toast, you have to try it.  It's the best french toast I've ever had, and many at our table agreed.  The secret is that they bread it in cornflakes.  Yum.  And, the bloody Marys are in the excellent range, I'd say just below the phenomenal ones at Dick's/Rokerij.  The service was also friendly and quick."},"stars":4,"business_id":"Xq9tkiHhyN_aBFswFeGLvA","business_city":"Phoenix","business_full_address":"2 E Jefferson St\nSte 150\nPhoenix, AZ 85004","business_categories":"American (New); Restaurants","business_name":"The Arrogant Butcher","served_dishes":["bloody Marys","egg sandwich sans bacon","french toast","french toast","cream and berries","french toast","french toast"],"_id":"QqUj8brMiWkMicmlWtpPrw","score":0.30000001192092896} 
{"id":"cVDmpkto6Fs-LwCkxKPx3g","text_snippet":{"content":"I think all the 5 star reviews are from people who work here, of which there must be 500.  Look at the trend all 5s then 2,3 and a few 4s.  I HATE that.\n\nFirst off, it bills itself as a steak/chop house or American Grill- whatever that is.  It is not a Steakhouse, despite have butcher in the name.\n\nLets start with the ambiance:  Don't ever sit in the back room, it is so loud it is like trying to eat in a drum.  Also, what is up with the TV?  If I wanted to watch TV while I ate I would stay at home, or go to a sports bar.\n\nNext the service:  It sucked.  There must have been 20 Servers, yet service was slow and inattentive.  I know the place is new, but they did not even have a wine list printed.  When we asked for the wine list, they first said they did not have one.  Sitting in the back room, I could see the freaking bottles.  Then, they sent us the manager, who was clueless.  She then the Bar manager.  Who looked like he used word to type up what he thought he had.  He was knowledgeable about wine at least.   Other than that the servers were slow and did not know the menu well.\n\nDrinks:  My Dad ordered a Margarita, it was awful.  We complained to our server who sent over the Bar Manager.  The bar manager made him a second one, which was passable.  For that price it should have been great.  I ordered a draft IPA, they were out.  I got a 22 bottle it was good.  My mom got a 7 and 7, it was fine.   \n\nNow the Wine, WAY over priced.  An average markup is about double, it was triple or more here.  I.E. a $12 bottle at the store should be about $20-24 in a restaurant, it is $36+ here.\nNo value\n\nFood:  Meh at best.  The best part of the meal was the Cheese/meat plate.  Me and my Dad had the Ribeye.  The meat was drowned in a sweet sauce with mushrooms and cauliflower, I liked the Sauce, My dad did not.  But the sauce really over powered the steak.\nMy mom had the Pork and Beans, she loved it.  All in all not the worst meal I ever had, but no value here.\n\nDessert:  I would not know, I am allergic to Peanuts and True nuts, not a single desert was nut free.  My Mom had the peanut butter cup - she loved it.  Also, they had no dessert wines, or any after dinner drinks.\n\nValue:  $80 a person with food, wine, and drinks. I can think of many other places I could go and get a better meal for that price, or less! For example,  We had dinner at the Tuck shop the night before, the meal was great, and drinks and dinner was $80 Total!"},"stars":2,"business_id":"Xq9tkiHhyN_aBFswFeGLvA","business_city":"Phoenix","business_full_address":"2 E Jefferson St\nSte 150\nPhoenix, AZ 85004","business_categories":"American (New); Restaurants","business_name":"The Arrogant Butcher","served_dishes":["butcher","freaking bottles","sweet sauce","mushrooms and cauliflower","nut free","peanut butter cup","dessert wines"],"_id":"cVDmpkto6Fs-LwCkxKPx3g","score":-0.30000001192092896} 
{"id":"HD1nAo1VffZZoUQH1ra5WA","text_snippet":{"content":"Wanted a restaurant within walking distance of our hotel so picked this one.  Was ok:  Nothing major to complain about, but also really nothing to rave about either.  There are better restaurants to choose from."},"stars":3,"business_id":"Xq9tkiHhyN_aBFswFeGLvA","business_city":"Phoenix","business_full_address":"2 E Jefferson St\nSte 150\nPhoenix, AZ 85004","business_categories":"American (New); Restaurants","business_name":"The Arrogant Butcher","served_dishes":[],"_id":"HD1nAo1VffZZoUQH1ra5WA","score":0} 
{"id":"5WSHeWRxZ91ACTBwkkWZ5w","text_snippet":{"content":"Absolutely loved this place! My fiance and I came across the Arrogant Butcher while we were in Phoenix celebrating my birthday and our engagement. My fiance had found it on yelp and said \"we must go there for lunch one day\" while we were there. We ended up going here for my birthday dinner, after a \"higher end\" establishment couldn't accomodate my gluten allergy. The food, the drinks and the waitstaff were great! It was so good, we went back the next day!"},"stars":5,"business_id":"Xq9tkiHhyN_aBFswFeGLvA","business_city":"Phoenix","business_full_address":"2 E Jefferson St\nSte 150\nPhoenix, AZ 85004","business_categories":"American (New); Restaurants","business_name":"The Arrogant Butcher","served_dishes":["waitstaff"],"_id":"5WSHeWRxZ91ACTBwkkWZ5w","score":0.5} 
{"id":"610bQ6gopW_nd0Q0RNo0BA","text_snippet":{"content":"Great atmosphere, friendly staff, and good food.  Dined with a large group so we had a set menu. I requested no butter with my crab stuffed chicken breast but they served it on the side just in case I felt the chicken was too dry.  It was de-lish!"},"stars":3,"business_id":"Xq9tkiHhyN_aBFswFeGLvA","business_city":"Phoenix","business_full_address":"2 E Jefferson St\nSte 150\nPhoenix, AZ 85004","business_categories":"American (New); Restaurants","business_name":"The Arrogant Butcher","served_dishes":["butter","crab stuffed chicken breast","chicken"],"_id":"610bQ6gopW_nd0Q0RNo0BA","score":0} 
{"id":"_Ctic3_Iuw0ECtqH2Yw5yQ","text_snippet":{"content":"Took my fiance' there for Valentine's day/ Birthday.  I did a lot of research of romantic places around the Valley, and this one really caught my eye.  Immediately after walking through the door, you'll notice a dark and romantic ambiance with a lot of candle light.  Seating is a bit tight, but it wasn't bad enough for me to give it a lower review.  We began with an appetizer called \"Table side guacamole\" which was incredible to say the least.  It literally is made in front of your table.  Then it was onto the main dish... Build-your-own  Pork tacos.  Talk about tender meat!!  The shoulder of pork literally fell right off onto the fork.  The tortillas were exceptional, and so was the tasty sauce which included pineapple glaze.  So, the food was absolutely delicious...but the service was equally impressive.  My water level never reached the bottom of the glass the entire night, and I drink plenty!  Everyone was incredibly nice and cheerfully said \"Happy Valentine's Day!\" and \"Happy Birthday!\" to my fiance', which made the experience even better.  A fantastic place that I'll have no problem recommending to others to visit!"},"stars":5,"business_id":"YKOvlBNkF4KpUP9q7x862w","business_city":"Scottsdale","business_full_address":"3815 N Brown Ave\nScottsdale, AZ 85251","business_categories":"Latin American; Restaurants","business_name":"The Mission","served_dishes":["dark and romantic","candle light","-your-own","Pork tacos","tender meat","pork","tortillas","tasty sauce","pineapple glaze"],"_id":"_Ctic3_Iuw0ECtqH2Yw5yQ","score":0.4000000059604645} 
{"id":"OmcoLT0j_RrCuU3cl_BdVw","text_snippet":{"content":"There's a lot to love about The Mission.  The experience comes so close to 5-star that it makes me want to nit-pick about all the tiny things that fall juuuust short so they can fix them for my next visit!\n\nThe Bar: What a lovely, refreshing Basil margarita!  It was just sweet enough without being syrupy.  But bartender, why is getting a recommendation out of you like pulling teeth?\n\nThe Food: Excellent table-side guacamole; it lived up to the very high expectations set by all the other reviewers.  My dinner partner's Hangar Steak was very juicy for such a thin cut and the dressing from the tomatillo salad give the whole dish a tangy, acidic bite.  My Chorizo Porchetta was very unique and flavorful, but a little more sauce would've saved it from being slightly dry.  I love though how the star of the entrees really is the meat here, the portions were generous and the sides were an accompaniment, not a competitor.\n***Almost forgot about the pumpkin bread pudding we shared!  He loved the scotch-carmel sauce which I thought was too sweet.  I loved the moist, fragrant bread which he thought was missing pumpkin-y spice.  To each their own!\n\nThe Atmosphere:  It's a gothic romance come to life with beautiful dark metal chandeliers, warm, glowing salt bricks, and dim lighting.  I just wish the table of 6 old men talking golf wasn't sooo close.  A little more room between tables would complete the intimate decor.\n\nThe Service:  I have no complaints here!  Our server was excellent and never overwhelming, the lady who made our guac was all charm, and kudos to the chef who sent us complimentary street corn (yummy by the way).  \n\nA note on the street corn: I felt like this was a dish that would've won the Top Chef competition where they had to re-invent convenience store food.  The grilled, slightly salty & crunchy corn topped with creamy spicy cheese sauce beats any AM-PM nachos I've ever had! :)\n\nLots of wonderful food still to try here.  I will be back very soon for brunch with mom!"},"stars":4,"business_id":"YKOvlBNkF4KpUP9q7x862w","business_city":"Scottsdale","business_full_address":"3815 N Brown Ave\nScottsdale, AZ 85251","business_categories":"Latin American; Restaurants","business_name":"The Mission","served_dishes":["Basil margarita","thin cut","tomatillo salad","tangy, acidic bite","entrees","pumpkin bread pudding","scotch-carmel sauce","moist, fragrant bread","pumpkin-y spice","dark metal","warm, glowing","salt bricks","old men","golf","guac","complimentary street corn","street corn","grilled, slightly salty & crunchy corn","creamy spicy cheese sauce"],"_id":"OmcoLT0j_RrCuU3cl_BdVw","score":0.5} 
{"id":"PikrkILIWSQiT5Oyi3MZ1w","text_snippet":{"content":"A  bit surprised at the high prices but figured that the \"trendy factor in old town\" and the atmosphere was the reason because the teeny portions of the food and the quality is just GOOD, like the Good egg, not great, not bad, just good. \nNo happy hour?\nAnd Too dark inside. \nLots of pretty wait staff. \nMy first suggestion would be to fire grill the mahi tacos and not batter them, they were not that flavorful. The side dishes of street corn and some potato chorizo thing were very good. I wanted to try the guac, but 12 bucks for an avacado with some garlic and cilantro? How about trying to make a good ceviche?\n\nMy hubby and i thought that Rubios rocks in comparison, we love the shrimp tacos and the pablano and portobello tacos."},"stars":3,"business_id":"YKOvlBNkF4KpUP9q7x862w","business_city":"Scottsdale","business_full_address":"3815 N Brown Ave\nScottsdale, AZ 85251","business_categories":"Latin American; Restaurants","business_name":"The Mission","served_dishes":["mahi tacos","street corn","potato chorizo thing","guac","garlic and cilantro","ceviche","shrimp tacos"],"_id":"PikrkILIWSQiT5Oyi3MZ1w","score":-0.10000000149011612} 
{"id":"N2q3TaeGPf-u4hbQOSZ13g","text_snippet":{"content":"Since The Mission is getting ready to celebrate their one year anniversary, I figure it's time for an update.  I went in for my first visit last November, shortly after they opened, and I've been in countless times since.  The atmosphere is amazing, the staff welcoming, the food unique and tasty... oh, and the drinks go down easy too!\n\nThe Mission has become Jared's second home - he's there much more than I am!  I go for an occasional drink or dinner.  My favorite menu item is the tableside prepared guacamole.  It's fantastic!  I am also a huge fan of the white bean puree, the street corn, and the salmon.  I wish they had some lighter options on the menu though - just a suggestion on behalf of those of us that are health-conscious!\n\nIf you enjoy Latin-inspired fare, for sure go check out The Mission... Or at the very least, go in for a drink and some guacamole.  Look for Jared at the bar when you're there!\n\nI\"ll for sure be excited to celebrate The Mission's one year anniversary in late October.  I'm sure it will be one helluva party!  It always is at The Mission!"},"stars":4,"business_id":"YKOvlBNkF4KpUP9q7x862w","business_city":"Scottsdale","business_full_address":"3815 N Brown Ave\nScottsdale, AZ 85251","business_categories":"Latin American; Restaurants","business_name":"The Mission","served_dishes":["guacamole","white bean puree","street corn","salmon","Latin-inspired","guacamole"],"_id":"N2q3TaeGPf-u4hbQOSZ13g","score":0.5} 
{"id":"ES4-S0n_LN5PmtJHmiwf8g","text_snippet":{"content":"I was toying with the idea of going on the wagon for a few weeks when I met my friend at The Mission, but the Sophia Loren cocktail caught my eye. My friend was intrigued by the Mexican Painkiller, and I couldn't let her drink alone. And oh, I'm so glad I'm such a good friend. \n\nThe Sophia instantly made my list as one of the best cocktails I have ever had - fresh strawberries and mint muddled in rum and another liqueur I can't remember. Just sweet enough to be refreshing. And plenty strong enough to make any hour happy. This drink defines the word elixir. It is as intoxicatingly unforgettable as its namesake."},"stars":4,"business_id":"YKOvlBNkF4KpUP9q7x862w","business_city":"Scottsdale","business_full_address":"3815 N Brown Ave\nScottsdale, AZ 85251","business_categories":"Latin American; Restaurants","business_name":"The Mission","served_dishes":["strawberries and mint","elixir"],"_id":"ES4-S0n_LN5PmtJHmiwf8g","score":0.699999988079071} 
